Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/pal/targets/TARGET_STM32/Src/stm32_cyhal_uart.c
/***************************************************************************************************
 * \file cyhal_uart.c
 *
 * \brief
 * Provides a high level interface for interacting with the STM32 UART. This is
 * a wrapper around the lower level PDL API.
 *
 ***************************************************************************************************
 * \copyright
 * Copyright 2021 Cypress Semiconductor Corporation
 * This software, including source code, documentation and related materials
 * ("Software"), is owned by Cypress Semiconductor Corporation or one of its
 * subsidiaries ("Cypress") and is protected by and subject to worldwide patent
 * protection (United States and foreign), United States copyright laws and
 * international treaty provisions. Therefore, you may use this Software only
 * as provided in the license agreement accompanying the software package from
 * which you obtained this Software ("EULA").
 *
 * If no EULA applies, Cypress hereby grants you a personal, non-exclusive,
 * non-transferable license to copy, modify, and compile the Software source
 * code solely for use in connection with Cypress's integrated circuit products.
 * Any reproduction, modification, translation, compilation, or representation
 * of this Software except as specified above is prohibited without the express
 * written permission of Cypress.
 *
 * Disclaimer: THIS SOFTWARE IS PROVIDED AS-IS, WITH NO WARRANTY OF ANY KIND,
 * EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, NONINFRINGEMENT, IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. Cypress
 * reserves the right to make changes to the Software without notice. Cypress
 * does not assume any liability arising out of the application or use of the
 * Software or any product or circuit described in the Software. Cypress does
 * not authorize its products for use in any products where a malfunction or
 * failure of the Cypress product may reasonably be expected to result in
 * significant property damage, injury or death ("High Risk Product"). By
 * including Cypress's product in a High Risk Product, the manufacturer of such
 * system or application assumes all risk of such use and in doing so agrees to
 * indemnify Cypress against all liability.
 **************************************************************************************************/

#include <stdlib.h>
#include <string.h>
#include "cy_utils.h"
#include "cyhal_hw_types.h"
#include "cyhal_uart.h"
#include "stm32_cyhal_uart_ex.h"
#include "cyhal_syspm.h"

#include "stm32_cyhal_common.h"

#if (CYHAL_UART_USE_RTOS_MUTEX == 1)
#include "cyabs_rtos.h"
#include "cyabs_rtos_impl.h"
#endif /* (CYHAL_UART_USE_RTOS_MUTEX == 1) */


#if defined(HAL_UART_MODULE_ENABLED)

#if defined(__cplusplus)
extern "C"
{
#endif

/***************************************************************************************************
 *      Private macros
 **************************************************************************************************/

#define CYHAL_UART_OVERSAMPLE                 (12UL)
#define CYHAL_UART_OVERSAMPLE_MIN             (8UL)
#define CYHAL_UART_OVERSAMPLE_MAX             (16UL)

#define CYHAL_REPEAT_OPERATION                (10UL)


/***************************************************************************************************
 *      Private types
 **************************************************************************************************/

typedef struct
{
    UART_HandleTypeDef* huart;
    cyhal_gpio_t        associate_pin;
    cyhal_uart_t*       occupied_obj;
    #if (CYHAL_UART_USE_RTOS_MUTEX == 1)
    cy_mutex_t          lock;
    #endif /* (CYHAL_UART_USE_RTOS_MUTEX == 1) */
} stm32_cyhal_uart_structs_t;


/***************************************************************************************************
 *      Private variables
 **************************************************************************************************/

static stm32_cyhal_uart_structs_t _cyhal_uart_structs[CYHAL_UART_MAX_INSTANCES] =
    { 0 }; /* init with zeros */


/***************************************************************************************************
 *      Private functions
 **************************************************************************************************/

static uint32_t _stm32_cyhal_uart_convert_parity(cyhal_uart_parity_t parity);
static uint32_t _stm32_cyhal_uart_convert_stopbits(uint32_t stopbits);
static uint32_t _stm32_cyhal_uart_convert_wordlength(uint32_t wordlength);
static UART_HandleTypeDef* _stm32_cyhal_uart_alloc_hw(cyhal_uart_t* obj, cyhal_gpio_t tx,
                                                      cyhal_gpio_t rx);
static void _stm32_cyhal_uart_free_hw(cyhal_uart_t* obj);
static void cyhal_uart_prepare_dma_buffer(cyhal_uart_t* obj, void* buffer, size_t length,
                                          bool is_tx);
static void _stm32_cyhal_uart_enable_irq(USART_TypeDef* instance, uint32_t priority, bool enable);
static void _stm32_cyhal_uart_critical_section_enter(cyhal_uart_t* obj);
static void _stm32_cyhal_uart_critical_section_exit(cyhal_uart_t* obj);
static IRQn_Type _stm32_cyhal_uart_get_irqn(USART_TypeDef* instance);
static IRQn_Type _stm32_cyhal_uart_get_dma_irqn(DMA_HandleTypeDef* hdma);
#if (USE_HAL_UART_REGISTER_CALLBACKS == 1)
static cyhal_uart_t* _stm32_cyhal_uart_get_obj(UART_HandleTypeDef* huart);
static void _stm32_cyhal_uart_tx_complete_callback(UART_HandleTypeDef* huart);
static void _stm32_cyhal_uart_rx_complete_callback(UART_HandleTypeDef* huart);
static void _stm32_cyhal_uart_error_callback(UART_HandleTypeDef* huart);
static void _stm32_cyhal_uart_rx_fifo_full_callback(UART_HandleTypeDef* huart);
static void _stm32_cyhal_uart_tx_fifo_empty_callback(UART_HandleTypeDef* huart);
static void _stm32_cyhal_uart_rx_not_empty_irq_handler(UART_HandleTypeDef* huart);
#endif /* #if (USE_HAL_UART_REGISTER_CALLBACKS == 1) */
#if (CYHAL_UART_USE_RTOS_MUTEX == 1)
static stm32_cyhal_uart_structs_t* _stm32_cyhal_uart_get_struct(cyhal_uart_t* obj);
#endif /* (CYHAL_UART_USE_RTOS_MUTEX == 1) */


/***************************************************************************************************
 * cyhal_uart_init
 **************************************************************************************************/
cy_rslt_t cyhal_uart_init(cyhal_uart_t* obj, cyhal_gpio_t tx, cyhal_gpio_t rx,
                          cyhal_gpio_t cts, cyhal_gpio_t rts, const cyhal_clock_t* clk,
                          const cyhal_uart_cfg_t* cfg)
{
    (void)clk;
    (void)cts;
    (void)rts;

    HAL_StatusTypeDef status = HAL_OK;

    /* Check the parameters */
    assert_param(NULL != obj);
    assert_param(NULL != cfg);
    assert_param((NC != tx) && (NC != rx));

    /* Clean uart object */
    (void)memset(obj, 0, sizeof(cyhal_uart_t));

    /* Try to allocate uart instance from _cyhal_uart_structs table */
    obj->huart = _stm32_cyhal_uart_alloc_hw(obj, tx, rx);
    if (obj->huart != NULL)
    {
        uint32_t temp;
        bool     new_config = false;

