Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/pal/targets/TARGET_STM32/Src/stm32_cyhal_uart.c
        /* Disable UART interrupts enabled by Stm32CubeMx
         * the cyhal_uart_enable_event function enables these interrupts
         * when needed */
        _stm32_cyhal_uart_enable_irq(obj->huart->Instance, 0u, false);

        /* Set common parameters from cyhal_uart_cfg_t */
        temp = _stm32_cyhal_uart_convert_wordlength(cfg->data_bits);
        if (obj->huart->Init.WordLength != temp)
        {
            obj->huart->Init.WordLength = temp;
            new_config                  = true;
        }

        temp = _stm32_cyhal_uart_convert_stopbits(cfg->stop_bits);
        if (obj->huart->Init.StopBits != temp)
        {
            obj->huart->Init.StopBits =temp;
            new_config                = true;
        }

        temp = _stm32_cyhal_uart_convert_parity(cfg->parity);
        if (obj->huart->Init.Parity != temp)
        {
            obj->huart->Init.Parity = temp;
            new_config              = true;
        }

        /* NOTE: skip uart initialize in following cases
         *   -- uart is initialized (state != HAL_UART_STATE_RESET) and
         *   -- init parameters is the same as in input configuration (cfg)
         */
        if ((obj->huart->gState == HAL_UART_STATE_RESET) || new_config)
        {
            /* Initialize the UART mode according to the specified parameters */
            status = HAL_UART_Init(obj->huart);

            if (status == HAL_OK)
            {
                status = HAL_UARTEx_SetTxFifoThreshold(obj->huart, UART_TXFIFO_THRESHOLD_1_8);
            }

            if (status == HAL_OK)
            {
                status = HAL_UARTEx_SetRxFifoThreshold(obj->huart, UART_RXFIFO_THRESHOLD_1_8);
            }

            if (status == HAL_OK)
            {
                status = HAL_UARTEx_DisableFifoMode(obj->huart);
            }
        }

        if (__HAL_UART_GET_IT(obj->huart, UART_IT_RXNE))
        {
            /* Send Receive Data flush Request to discard the received data */
            __HAL_UART_SEND_REQ(obj->huart, UART_RXDATA_FLUSH_REQUEST);
        }

        if (status != HAL_OK)
        {
            cyhal_uart_free(obj);
        }
    }
    else
    {
        /* Making out an error code 15, which is far enough from already implemented */
        return (CY_RSLT_CREATE(CY_RSLT_TYPE_ERROR, CYHAL_RSLT_MODULE_UART, 15));
    }

    #if (CYHAL_UART_USE_RTOS_MUTEX == 1)
    if (status == HAL_OK)
    {
        /* Initialize UART resource mutex.  */
        stm32_cyhal_uart_structs_t* uart_struct = _stm32_cyhal_uart_get_struct(obj);
        status = (cy_rtos_init_mutex(&uart_struct->lock) == CY_RSLT_SUCCESS) ?
                 HAL_OK : HAL_ERROR;
    }
    #endif /* (CYHAL_UART_USE_RTOS_MUTEX == 1) */

    return ((status != HAL_OK) ? CYHAL_UART_RSLT_ERR_HAL_ERROR : CY_RSLT_SUCCESS);
}


/***************************************************************************************************
 * cyhal_uart_free
 **************************************************************************************************/
void cyhal_uart_free(cyhal_uart_t* obj)
{
    /* Check the parameters */
    assert_param(NULL != obj);

    #if (CYHAL_UART_USE_RTOS_MUTEX == 1)
    /* De-initialize the UART mutex */
    stm32_cyhal_uart_structs_t* uart_struct = _stm32_cyhal_uart_get_struct(obj);
    (void)cy_rtos_deinit_mutex(&uart_struct->lock);
    #endif /* (CYHAL_UART_USE_RTOS_MUTEX == 1) */

    /* De-initialize the UART peripheral */
    (void)HAL_UART_DeInit(obj->huart);

    /* Free from uart resource table */
    _stm32_cyhal_uart_free_hw(obj);
}


/***************************************************************************************************
 * cyhal_uart_set_baud
 **************************************************************************************************/
cy_rslt_t cyhal_uart_set_baud(cyhal_uart_t* obj, uint32_t baudrate, uint32_t* actualbaud)
{
    /* Check the parameters */
    assert_param(NULL != obj);
    assert_param(NULL != actualbaud);

    if (actualbaud != NULL)
    {
        *actualbaud = baudrate;
    }

    if (baudrate == obj->huart->Init.BaudRate)
    {
        return CY_RSLT_SUCCESS;
    }

    /* Set new baud rate value */
    obj->huart->Init.BaudRate = baudrate;

    return ((UART_SetConfig(obj->huart) !=
             HAL_OK) ? CYHAL_UART_RSLT_ERR_HAL_ERROR : CY_RSLT_SUCCESS);
}


/***************************************************************************************************
 * cyhal_uart_configure
 **************************************************************************************************/
cy_rslt_t cyhal_uart_configure(cyhal_uart_t* obj, const cyhal_uart_cfg_t* cfg)
{
    /* Check the parameters */
    assert_param(NULL != obj);
    assert_param(NULL != cfg);

    obj->huart->Init.Parity     = _stm32_cyhal_uart_convert_parity(cfg->parity);
    obj->huart->Init.StopBits   = _stm32_cyhal_uart_convert_stopbits(cfg->stop_bits);
    obj->huart->Init.WordLength = _stm32_cyhal_uart_convert_wordlength(cfg->data_bits);

    return ((UART_SetConfig(obj->huart) !=
             HAL_OK) ? CYHAL_UART_RSLT_ERR_HAL_ERROR : CY_RSLT_SUCCESS);
}


/***************************************************************************************************
 * cyhal_uart_set_flow_control
 **************************************************************************************************/
cy_rslt_t cyhal_uart_enable_flow_control(cyhal_uart_t* obj, bool enable_cts, bool enable_rts)
{
    /* Check the parameters */
    assert_param(NULL != obj);

    if (!enable_cts && enable_rts)
    {
        obj->huart->Init.HwFlowCtl = UART_HWCONTROL_RTS;
    }
    else if (enable_cts && !enable_rts)
    {
        obj->huart->Init.HwFlowCtl = UART_HWCONTROL_CTS;
    }
    else if (enable_rts)
    {
        obj->huart->Init.HwFlowCtl = UART_HWCONTROL_RTS_CTS;
    }
    else
    {
        obj->huart->Init.HwFlowCtl = UART_HWCONTROL_NONE;
    }

    return ((UART_SetConfig(obj->huart) !=
             HAL_OK) ? CYHAL_UART_RSLT_ERR_HAL_ERROR : CY_RSLT_SUCCESS);
}


/***************************************************************************************************
 * cyhal_uart_write
 **************************************************************************************************/
cy_rslt_t cyhal_uart_write(cyhal_uart_t* obj, void* tx, size_t* tx_length)
{
    /* Check the parameters */
    assert_param(NULL != obj);
    assert_param(NULL != tx);
    assert_param(NULL != tx_length);

    HAL_StatusTypeDef status;

