Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/pal/targets/TARGET_STM32/Src/stm32_cyhal_uart.c
    /* Enter UART critical section (disable UART interrupt if it is enabled) */
    _stm32_cyhal_uart_critical_section_enter(obj);

    /* Send an amount of data in blocking mode */
    status = HAL_UART_Transmit(obj->huart, tx, (uint16_t)*tx_length, 0xFFFF);

    /* Exit UART critical section */
    _stm32_cyhal_uart_critical_section_exit(obj);

    if (status == HAL_BUSY)
    {
        return CYHAL_SYSPM_RSLT_ERR_PM_PENDING;
    }
    else
    {
        return ((status != HAL_OK) ? CYHAL_UART_RSLT_ERR_HAL_ERROR : CY_RSLT_SUCCESS);
    }
}


/***************************************************************************************************
 * cyhal_uart_read
 **************************************************************************************************/
cy_rslt_t cyhal_uart_read(cyhal_uart_t* obj, void* rx, size_t* rx_length)
{
    HAL_StatusTypeDef status = HAL_TIMEOUT;

    /* Check the parameters */
    assert_param(NULL != obj);
    assert_param(NULL != rx);
    assert_param(NULL != rx_length);

    /* Check Receive data register not empty flag */
    if (__HAL_UART_GET_FLAG(obj->huart, UART_FLAG_RXNE) != 0u)
    {
        /* Enter UART critical section (disable UART interrupt if it is enabled) */
        _stm32_cyhal_uart_critical_section_enter(obj);

        /* Receive an amount of data in blocking mode */
        status = HAL_UART_Receive(obj->huart, rx, (uint16_t)*rx_length, 0U);

        /* Exit UART critical section */
        _stm32_cyhal_uart_critical_section_exit(obj);

        if (status == HAL_TIMEOUT)
        {
            *rx_length = *rx_length - obj->huart->RxXferCount;
        }
    }
    else
    {
        *rx_length = 0;
    }

    if (status == HAL_BUSY)
    {
        return CYHAL_SYSPM_RSLT_ERR_PM_PENDING;
    }
    else
    {
        return (((status == HAL_TIMEOUT) || (status == HAL_OK)) ?
                CY_RSLT_SUCCESS : CYHAL_UART_RSLT_ERR_HAL_ERROR);
    }
}


/***************************************************************************************************
 * cyhal_uart_write_abort
 **************************************************************************************************/
cy_rslt_t cyhal_uart_write_abort(cyhal_uart_t* obj)
{
    /* Check the parameters */
    assert_param(NULL != obj);

    return ((HAL_UART_AbortTransmit(obj->huart) !=
             HAL_OK) ? CYHAL_UART_RSLT_ERR_HAL_ERROR : CY_RSLT_SUCCESS);
}


/***************************************************************************************************
 * cyhal_uart_read_abort
 **************************************************************************************************/
cy_rslt_t cyhal_uart_read_abort(cyhal_uart_t* obj)
{
    /* Check the parameters */
    assert_param(NULL != obj);

    return ((HAL_UART_AbortReceive(obj->huart) !=
             HAL_OK) ? CYHAL_UART_RSLT_ERR_HAL_ERROR : CY_RSLT_SUCCESS);
}


/***************************************************************************************************
 * cyhal_uart_prepare_dma_tx_buf
 **************************************************************************************************/
static void cyhal_uart_prepare_dma_buffer(cyhal_uart_t* obj, void* buffer, size_t length,
                                          bool is_tx)
{
    if (is_tx)
    {
        /* TX */
        /* Copy data to DMA buffer */
        (void)memcpy((void*)obj->dma_buff.tx, buffer, length);

        /* D-cache maintenance */
        #if defined(_CYHAL_DCACHE_MAINTENANCE)
        SCB_CleanDCache_by_Addr((uint32_t*)obj->dma_buff.tx, CYHAL_UART_TX_DMA_BUFFER_SIZE);
        #endif
    }
    else
    {
        /* RX */
        /* Store buffer address */
        obj->rx_async_buff     = (void*)buffer;
        obj->rx_async_buff_len = length;

        /* D-cache maintenance */
        #if defined(_CYHAL_DCACHE_MAINTENANCE)
        /* Cache-Invalidate the output from DMA */
        SCB_InvalidateDCache_by_Addr((uint32_t*)obj->dma_buff.rx, CYHAL_UART_RX_DMA_BUFFER_SIZE);
        #endif
    }
}


/***************************************************************************************************
 * cyhal_uart_write_async
 **************************************************************************************************/
cy_rslt_t cyhal_uart_write_async(cyhal_uart_t* obj, void* tx, size_t length)
{
    HAL_StatusTypeDef status;
    uint32_t          repeat_operation = CYHAL_REPEAT_OPERATION;

    /* Check the parameters */
    assert_param(NULL != obj);
    assert_param(NULL != tx);
    assert_param((0u != length) && (length < CYHAL_UART_TX_DMA_BUFFER_SIZE));

    /* Lock UART resource  */
    #if (CYHAL_UART_USE_RTOS_MUTEX == 1)
    stm32_cyhal_uart_structs_t* uart_struct = _stm32_cyhal_uart_get_struct(obj);
    if (cy_rtos_get_mutex(&uart_struct->lock, CY_RTOS_NEVER_TIMEOUT) != CY_RSLT_SUCCESS)
    {
        return CYHAL_SYSPM_RSLT_ERR_PM_PENDING;
    }
    #endif /* (CYHAL_UART_USE_RTOS_MUTEX == 1) */

    /* Prepare DMA buffer */
    if (obj->huart->hdmarx != NULL)
    {
        cyhal_uart_prepare_dma_buffer(obj, tx, length, true);
    }

    /* Enter UART critical section (disable UART interrupt if it is enabled) */
    _stm32_cyhal_uart_critical_section_enter(obj);

    /* Transit operation */
    do
    {
        if (obj->huart->hdmatx == NULL)
        {
            status = HAL_UART_Transmit_IT(obj->huart, tx, (uint16_t)length);
        }
        else
        {
            status = HAL_UART_Transmit_DMA(obj->huart, (uint8_t*)obj->dma_buff.tx,
                                           (uint16_t)length);
        }

        if (status != HAL_OK)
        {
            HAL_Delay(1);
        }

        repeat_operation--;
    } while ((status != HAL_OK) && (repeat_operation != 0u));

    /* Exit UART critical section */
    _stm32_cyhal_uart_critical_section_exit(obj);

    #if (CYHAL_UART_USE_RTOS_MUTEX == 1)
    /* Un-lock UART resource */
    (void)cy_rtos_set_mutex(&uart_struct->lock);
    #endif /* (CYHAL_UART_USE_RTOS_MUTEX == 1) */

    if (status == HAL_BUSY)
    {
        return CYHAL_SYSPM_RSLT_ERR_PM_PENDING;
    }
    else
    {
        return ((status != HAL_OK) ? CYHAL_UART_RSLT_ERR_HAL_ERROR : CY_RSLT_SUCCESS);
    }
}


/***************************************************************************************************
 * cyhal_uart_read_async
 **************************************************************************************************/
cy_rslt_t cyhal_uart_read_async(cyhal_uart_t* obj, void* rx, size_t length)
{
    HAL_StatusTypeDef status;
    uint32_t          repeat_operation = CYHAL_REPEAT_OPERATION;

    /* Check the parameters */
    assert_param(NULL != obj);
    assert_param(NULL != rx);
    assert_param((0u != length) && (length < CYHAL_UART_RX_DMA_BUFFER_SIZE));

    #if (CYHAL_UART_USE_RTOS_MUTEX == 1)
    /* Lock UART resource  */
    stm32_cyhal_uart_structs_t* uart_struct = _stm32_cyhal_uart_get_struct(obj);
    if (cy_rtos_get_mutex(&uart_struct->lock, CY_RTOS_NEVER_TIMEOUT) != CY_RSLT_SUCCESS)
    {
        return CYHAL_SYSPM_RSLT_ERR_PM_PENDING;
    }
    #endif /* (CYHAL_UART_USE_RTOS_MUTEX == 1) */

    /* Prepare DMA buffer */
    if (obj->huart->hdmarx != NULL)
    {
        cyhal_uart_prepare_dma_buffer(obj, rx, length, false);
    }

