Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/pal/targets/TARGET_STM32/Src/stm32_cyhal_uart.c
    /* Enter UART critical section (disable UART interrupt if it is enabled) */
    _stm32_cyhal_uart_critical_section_enter(obj);

    /* Receive Operation */
    do
    {
        if (obj->huart->hdmarx == NULL)
        {
            status = HAL_UART_Receive_IT(obj->huart, rx, (uint16_t)length);
        }
        else
        {
            status = HAL_UART_Receive_DMA(obj->huart, (uint8_t*)obj->dma_buff.rx, (uint16_t)length);
        }

        if (status != HAL_OK)
        {
            HAL_Delay(1);
        }
        repeat_operation--;
    } while ((status != HAL_OK) && (repeat_operation != 0u));

    /* Exit UART critical section */
    _stm32_cyhal_uart_critical_section_exit(obj);

    /* NOTE: keep context.rxBufIdx to have BWC with bluetooth-freertos (PSoC implementation) */
    obj->context.rxBufIdx = obj->huart->NbRxDataToProcess;

    #if (CYHAL_UART_USE_RTOS_MUTEX == 1)
    /* Un-lock UART resource */
    (void)cy_rtos_set_mutex(&uart_struct->lock);
    #endif /* (CYHAL_UART_USE_RTOS_MUTEX == 1) */

    if (status == HAL_BUSY)
    {
        return CYHAL_SYSPM_RSLT_ERR_PM_PENDING;
    }
    else
    {
        return ((status != HAL_OK) ? CYHAL_UART_RSLT_ERR_HAL_ERROR : CY_RSLT_SUCCESS);
    }
}


/***************************************************************************************************
 * cyhal_uart_is_tx_active
 **************************************************************************************************/
bool cyhal_uart_is_tx_active(cyhal_uart_t* obj)
{
    HAL_UART_StateTypeDef state;

    state = HAL_UART_GetState(obj->huart);

    /* NOTE: it will also return TRUE in case of both - TX AND RX are busy
     *       simultaneously */
    return ((state & HAL_UART_STATE_BUSY_TX) == HAL_UART_STATE_BUSY_TX);
}


/***************************************************************************************************
 * cyhal_uart_is_rx_active
 **************************************************************************************************/
bool cyhal_uart_is_rx_active(cyhal_uart_t* obj)
{
    HAL_UART_StateTypeDef state;

    state = HAL_UART_GetState(obj->huart);

    /* NOTE: it will also return TRUE in case of both - TX AND RX are busy
     *       simultaneously */
    return ((state & HAL_UART_STATE_BUSY_RX) == HAL_UART_STATE_BUSY_RX);
}


/***************************************************************************************************
 * Callback functions
 * NOTE: For UART callbacks, USE_HAL_UART_REGISTER_CALLBACKS must be enabled
 * in STM32CubeMx
 **************************************************************************************************/

#if (USE_HAL_UART_REGISTER_CALLBACKS == 1)

/***************************************************************************************************
 * _stm32_cyhal_uart_tx_complete_callback
 **************************************************************************************************/
static void _stm32_cyhal_uart_tx_complete_callback(UART_HandleTypeDef* huart)
{
    cyhal_uart_t* obj = _stm32_cyhal_uart_get_obj(huart);
    if (obj != NULL)
    {
        ((cyhal_uart_event_callback_t)obj->callback)(obj->callback_arg, CYHAL_UART_IRQ_TX_DONE);
    }
}


/***************************************************************************************************
 * _stm32_cyhal_uart_rx_complete_callback
 **************************************************************************************************/
static void _stm32_cyhal_uart_rx_complete_callback(UART_HandleTypeDef* huart)
{
    cyhal_uart_t* obj = _stm32_cyhal_uart_get_obj(huart);

    if (obj != NULL)
    {
        if (obj->huart->hdmarx != NULL)
        {
            (void)memcpy(obj->rx_async_buff, (void*)obj->dma_buff.rx, obj->rx_async_buff_len);
        }

        /* Call registered callback */
        if (obj->callback != NULL)
        {
            ((cyhal_uart_event_callback_t)obj->callback)(obj->callback_arg, CYHAL_UART_IRQ_RX_DONE);
        }

        if ((obj->irq & (uint32_t)CYHAL_UART_IRQ_RX_NOT_EMPTY) != 0U)
        {
            /* Restore the RxISR function pointer. RxISR is clean in default RX interrupt
             * handler, when Rx complete Set own RX handler to catch IRQ_RX_NOT_EMPTY
             * interrupt */
            obj->huart->RxISR = _stm32_cyhal_uart_rx_not_empty_irq_handler;

            /* Enable the UART Parity Error interrupt and Data Register Not Empty interrupt */
            SET_BIT(obj->huart->Instance->CR1, USART_CR1_RXNEIE_RXFNEIE);
        }
    }
}


/***************************************************************************************************
 * _stm32_cyhal_uart_error_callback
 **************************************************************************************************/
static void _stm32_cyhal_uart_error_callback(UART_HandleTypeDef* huart)
{
    cyhal_uart_t* obj = _stm32_cyhal_uart_get_obj(huart);
    if (obj != NULL)
    {
        if (obj->huart->RxState == HAL_UART_STATE_BUSY_RX)
        {
            ((cyhal_uart_event_callback_t)obj->callback)(obj->callback_arg,
                                                         CYHAL_UART_IRQ_RX_ERROR);
        }
        else
        {
            ((cyhal_uart_event_callback_t)obj->callback)(obj->callback_arg,
                                                         CYHAL_UART_IRQ_TX_ERROR);
        }
    }
}


/***************************************************************************************************
 * _stm32_cyhal_uart_rx_fifo_full_callback
 **************************************************************************************************/
static void _stm32_cyhal_uart_rx_fifo_full_callback(UART_HandleTypeDef* huart)
{
    cyhal_uart_t* obj = _stm32_cyhal_uart_get_obj(huart);
    if (obj != NULL)
    {
        ((cyhal_uart_event_callback_t)obj->callback)(obj->callback_arg,
                                                     CYHAL_UART_IRQ_RX_FULL);
    }
}


/***************************************************************************************************
 * _stm32_cyhal_uart_tx_fifo_empty_callback
 **************************************************************************************************/
static void _stm32_cyhal_uart_tx_fifo_empty_callback(UART_HandleTypeDef* huart)
{
    cyhal_uart_t* obj = _stm32_cyhal_uart_get_obj(huart);
    if (obj != NULL)
    {
        ((cyhal_uart_event_callback_t)obj->callback)(obj->callback_arg,
                                                     CYHAL_UART_IRQ_TX_EMPTY);
    }
}


/***************************************************************************************************
 * _stm32_cyhal_uart_rx_not_empty_irq_handler
 **************************************************************************************************/
static void _stm32_cyhal_uart_rx_not_empty_irq_handler(UART_HandleTypeDef* huart)
{
    cyhal_uart_t* obj = _stm32_cyhal_uart_get_obj(huart);
    if (obj != NULL)
    {
        ((cyhal_uart_event_callback_t)obj->callback)(obj->callback_arg,
                                                     CYHAL_UART_IRQ_RX_NOT_EMPTY);
    }
}


#endif /* (USE_HAL_UART_REGISTER_CALLBACKS == 1) */


/***************************************************************************************************
 * cyhal_uart_register_callback
 **************************************************************************************************/
void cyhal_uart_register_callback(cyhal_uart_t* obj, cyhal_uart_event_callback_t callback,
                                  void* callback_arg)
{
    /* Check the parameters */
    assert_param(NULL != obj);
    assert_param(NULL != callback);

