Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/pal/targets/TARGET_STM32/Src/stm32_cyhal_uart.c
    /* Store callback info */
    obj->callback     = (void*)callback;
    obj->callback_arg = callback_arg;
}


/***************************************************************************************************
 * cyhal_uart_enable_event
 *
 * NOTE: By default, the input parameter 'intr_priority' is skipped in
 * cyhal_uart_enable_event function. In STM32, all UARTS events that came from one
 * UARTx IRQ and the priority for this IRQ are set in STM32CubeMX Environment.
 *
 * For a user case that requires overwriting the UART IRQ priority
 * from cyhal_uart_enable_event, define the CYHAL_UART_USE_HAL_IRQ_PRIOPITY
 * macro in cybsp.h.
 *
 **************************************************************************************************/
void cyhal_uart_enable_event(cyhal_uart_t* obj, cyhal_uart_event_t event,
                             uint8_t intr_priority, bool enable)
{
    #if (USE_HAL_UART_REGISTER_CALLBACKS == 1)
    pUART_CallbackTypeDef p_callback;

    /* Register CYHAL_UART_IRQ_TX_DONE callback */
    if ((event & CYHAL_UART_IRQ_TX_DONE) != (uint32_t)CYHAL_UART_IRQ_NONE)
    {
        p_callback = &_stm32_cyhal_uart_tx_complete_callback;
        if (enable)
        {
            obj->irq |= (uint32_t)CYHAL_UART_IRQ_TX_DONE;
            (void)HAL_UART_RegisterCallback(obj->huart, HAL_UART_TX_COMPLETE_CB_ID, p_callback);
        }
        else
        {
            obj->irq &= (uint32_t) ~CYHAL_UART_IRQ_TX_DONE;
            (void)HAL_UART_UnRegisterCallback(obj->huart, HAL_UART_TX_COMPLETE_CB_ID);
        }
    }

    /* Register CYHAL_UART_IRQ_RX_DONE callback */
    if ((event & CYHAL_UART_IRQ_RX_DONE) != (uint32_t)CYHAL_UART_IRQ_NONE)
    {
        p_callback = &_stm32_cyhal_uart_rx_complete_callback;
        if (enable)
        {
            obj->irq |= (uint32_t)CYHAL_UART_IRQ_RX_DONE;
            (void)HAL_UART_RegisterCallback(obj->huart, HAL_UART_RX_COMPLETE_CB_ID, p_callback);
        }
        else
        {
            obj->irq &= (uint32_t) ~CYHAL_UART_IRQ_RX_DONE;
            (void)HAL_UART_UnRegisterCallback(obj->huart, HAL_UART_RX_COMPLETE_CB_ID);
        }
    }

    /* Register CYHAL_UART_IRQ_TX_ERROR  callback */
    if (((event & CYHAL_UART_IRQ_TX_ERROR) != (uint32_t)CYHAL_UART_IRQ_NONE) ||
        ((event & CYHAL_UART_IRQ_RX_ERROR) != (uint32_t)CYHAL_UART_IRQ_NONE))
    {
        p_callback = &_stm32_cyhal_uart_error_callback;
        if (enable)
        {
            obj->irq |= (uint32_t)event;
            (void)HAL_UART_RegisterCallback(obj->huart, HAL_UART_ERROR_CB_ID, p_callback);
        }
        else
        {
            obj->irq &= (uint32_t) ~event;
            (void)HAL_UART_UnRegisterCallback(obj->huart, HAL_UART_ERROR_CB_ID);
        }
    }

    /* Register CYHAL_UART_IRQ_RX_FULL callback */
    if ((event & CYHAL_UART_IRQ_RX_FULL) != (uint32_t)CYHAL_UART_IRQ_NONE)
    {
        p_callback = &_stm32_cyhal_uart_rx_fifo_full_callback;
        if (enable)
        {
            obj->irq |= (uint32_t)CYHAL_UART_IRQ_RX_FULL;
            (void)HAL_UART_RegisterCallback(obj->huart, HAL_UART_RX_FIFO_FULL_CB_ID, p_callback);
        }
        else
        {
            obj->irq &= (uint32_t) ~CYHAL_UART_IRQ_RX_FULL;
            (void)HAL_UART_UnRegisterCallback(obj->huart, HAL_UART_RX_FIFO_FULL_CB_ID);
        }
    }

    /* Register / un-register CYHAL_UART_IRQ_TX_EMPTY callback */
    if ((event & CYHAL_UART_IRQ_TX_EMPTY) != (uint32_t)CYHAL_UART_IRQ_NONE)
    {
        p_callback = &_stm32_cyhal_uart_tx_fifo_empty_callback;

        if (enable)
        {
            obj->irq |= (uint32_t)CYHAL_UART_IRQ_TX_EMPTY;
            (void)HAL_UART_RegisterCallback(obj->huart, HAL_UART_TX_FIFO_EMPTY_CB_ID, p_callback);
        }
        else
        {
            obj->irq &= (uint32_t) ~CYHAL_UART_IRQ_TX_EMPTY;
            (void)HAL_UART_UnRegisterCallback(obj->huart, HAL_UART_TX_FIFO_EMPTY_CB_ID);
        }
    }

    /* Register / un-register CYHAL_UART_IRQ_RX_NOT_EMPTY callback */
    if ((event & CYHAL_UART_IRQ_RX_NOT_EMPTY) != (uint32_t)CYHAL_UART_IRQ_NONE)
    {
        /* Enter UART critical section (disable UART interrupt if it is enabled) */
        _stm32_cyhal_uart_critical_section_enter(obj);

        if (enable)
        {
            obj->irq |= (uint32_t)CYHAL_UART_IRQ_RX_NOT_EMPTY;
            /* Update the RxISR function pointer. Set own RX handler to catch
             * IRQ_RX_NOT_EMPTY interrupt */
            obj->huart->RxISR = _stm32_cyhal_uart_rx_not_empty_irq_handler;

            /* Enable the Data Register Not Empty interrupt */
            SET_BIT(obj->huart->Instance->CR1, USART_CR1_RXNEIE_RXFNEIE);
        }
        else
        {
            obj->irq &= (uint32_t) ~CYHAL_UART_IRQ_RX_NOT_EMPTY;
            CLEAR_BIT(obj->huart->Instance->CR1, USART_CR1_RXNEIE_RXFNEIE);
        }

        /* Exit UART critical section */
        _stm32_cyhal_uart_critical_section_exit(obj);
    }

    /* Configure uart interrupt. Do not disable interrupt if we have have some
     * enabled  obj->irq */
    if ((enable) || (obj->irq == 0U))
    {
        _stm32_cyhal_uart_enable_irq(obj->huart->Instance, intr_priority, enable);
    }

    #else /* if (USE_HAL_UART_REGISTER_CALLBACKS == 1) */
    /* NOTE: USE_HAL_UART_REGISTER_CALLBACKS must be enabled */
    assert_param(false);
    #endif /*  (USE_HAL_UART_REGISTER_CALLBACKS == 1) */
}


/***************************************************************************************************
 * Private functions
 **************************************************************************************************/

/***************************************************************************************************
 * _stm32_cyhal_uart_convert_parity
 **************************************************************************************************/
static uint32_t _stm32_cyhal_uart_convert_parity(cyhal_uart_parity_t parity)
{
    uint32_t ret = 0xFFFFu;

    switch (parity)
    {
        case CYHAL_UART_PARITY_NONE:
            ret = UART_PARITY_NONE;
            break;

        case CYHAL_UART_PARITY_EVEN:
            ret = UART_PARITY_EVEN;
            break;

        case CYHAL_UART_PARITY_ODD:
            ret = UART_PARITY_ODD;
            break;

        default:
            assert_param(false); /* wrong value */
            break;
    }

