Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/pal/targets/TARGET_STM32/Src/stm32_cyhal_uart.c
    return (ret);
}


/***************************************************************************************************
 * _stm32_cyhal_uart_convert_stopbits
 **************************************************************************************************/
static uint32_t _stm32_cyhal_uart_convert_stopbits(uint32_t stopbits)
{
    uint32_t ret = 0xFFFFu;

    switch (stopbits)
    {
        case 1U:
            ret = UART_STOPBITS_1;
            break;

        case 2U:
            ret = UART_STOPBITS_2;
            break;

        default:
            assert_param(false); /* wrong value */
            break;
    }

    return (ret);
}


/***************************************************************************************************
 * _stm32_cyhal_uart_convert_wordlength
 **************************************************************************************************/
static uint32_t _stm32_cyhal_uart_convert_wordlength(uint32_t wordlength)
{
    uint32_t ret = 0xFFFFu;

    switch (wordlength)
    {
        case 7U:
            ret = UART_WORDLENGTH_7B;
            break;

        case 8U:
            ret = UART_WORDLENGTH_8B;
            break;

        case 9U:
            ret = UART_WORDLENGTH_9B;
            break;

        default:
            assert_param(false); /* wrong value */
            break;
    }

    return (ret);
}


/***************************************************************************************************
 * _stm32_cyhal_uart_get_irqn
 **************************************************************************************************/
static IRQn_Type _stm32_cyhal_uart_get_irqn(USART_TypeDef* instance)
{
    IRQn_Type IRQn = (IRQn_Type)0;

    #if defined (LPUART1)
    if (instance == LPUART1)
    {
        IRQn = LPUART1_IRQn;
    }
    else
    #endif

    #if defined (USART1)
    if (instance == USART1)
    {
        IRQn = USART1_IRQn;
    }
    else
    #endif

    #if defined (USART2)
    if (instance == USART2)
    {
        IRQn = USART2_IRQn;
    }
    else
    #endif

    #if defined (USART3)
    if (instance == USART3)
    {
        IRQn = USART3_IRQn;
    }
    else
    #endif

    #if defined (UART4)
    if (instance == UART4)
    {
        IRQn = UART4_IRQn;
    }
    else
    #endif

    #if defined (UART5)
    if (instance == UART5)
    {
        IRQn = UART5_IRQn;
    }
    else
    #endif

    #if defined (USART6)
    if (instance == USART6)
    {
        IRQn = USART6_IRQn;
    }
    else
    #endif

    #if defined (UART7)
    if (instance == UART7)
    {
        IRQn = UART7_IRQn;
    }
    else
    #endif

    #if defined (UART8)
    if (instance == UART8)
    {
        IRQn = UART8_IRQn;
    }
    else
    #endif
    {
        assert_param(false); /* wrong instance */
    }

    return (IRQn);
}


/***************************************************************************************************
 * _stm32_cyhal_uart_get_dma_irqn
 **************************************************************************************************/
static IRQn_Type _stm32_cyhal_uart_get_dma_irqn(DMA_HandleTypeDef* hdma)
{
    IRQn_Type IRQn = (IRQn_Type)0;

    #if defined (DMA1_Stream0)
    if (hdma->Instance == DMA1_Stream0)
    {
        IRQn = DMA1_Stream0_IRQn;
    }
    else
    #endif

    #if defined (DMA1_Stream1)
    if (hdma->Instance == DMA1_Stream1)
    {
        IRQn = DMA1_Stream1_IRQn;
    }
    else
    #endif

    #if defined (DMA1_Stream2)
    if (hdma->Instance == DMA1_Stream2)
    {
        IRQn = DMA1_Stream2_IRQn;
    }
    else
    #endif

    #if defined (DMA1_Stream3)
    if (hdma->Instance == DMA1_Stream3)
    {
        IRQn = DMA1_Stream3_IRQn;
    }
    else
    #endif

    #if defined (DMA1_Stream4)
    if (hdma->Instance == DMA1_Stream4)
    {
        IRQn = DMA1_Stream4_IRQn;
    }
    else
    #endif

    #if defined (DMA1_Stream5)
    if (hdma->Instance == DMA1_Stream5)
    {
        IRQn = DMA1_Stream5_IRQn;
    }
    else
    #endif

    #if defined (DMA1_Stream6)
    if (hdma->Instance == DMA1_Stream6)
    {
        IRQn = DMA1_Stream6_IRQn;
    }
    else
    #endif

    #if defined (DMA1_Stream7)
    if (hdma->Instance == DMA1_Stream7)
    {
        IRQn = DMA1_Stream7_IRQn;
    }
    else
    #endif

    #if defined (DMA2_Stream0)
    if (hdma->Instance == DMA2_Stream0)
    {
        IRQn = DMA2_Stream0_IRQn;
    }
    else
    #endif

    #if defined (DMA2_Stream1)
    if (hdma->Instance == DMA2_Stream1)
    {
        IRQn = DMA2_Stream1_IRQn;
    }
    else
    #endif

    #if defined (DMA2_Stream2)
    if (hdma->Instance == DMA2_Stream2)
    {
        IRQn = DMA2_Stream2_IRQn;
    }
    else
    #endif

    #if defined (DMA2_Stream3)
    if (hdma->Instance == DMA2_Stream3)
    {
        IRQn = DMA2_Stream3_IRQn;
    }
    else
    #endif

    #if defined (DMA2_Stream4)
    if (hdma->Instance == DMA2_Stream4)
    {
        IRQn = DMA2_Stream4_IRQn;
    }
    else
    #endif

    #if defined (DMA2_Stream5)
    if (hdma->Instance == DMA2_Stream5)
    {
        IRQn = DMA2_Stream5_IRQn;
    }
    else
    #endif

    #if defined (DMA2_Stream6)
    if (hdma->Instance == DMA2_Stream6)
    {
        IRQn = DMA2_Stream6_IRQn;
    }
    else
    #endif

    #if defined (DMA2_Stream7)
    if (hdma->Instance == DMA2_Stream7)
    {
        IRQn = DMA2_Stream7_IRQn;
    }
    else
    #endif

    /* STM32L5 uses Channel1..8 instead Stream0..7 */
    #if defined (DMA1_Channel1)
    if (hdma->Instance == DMA1_Channel1)
    {
        IRQn = DMA1_Channel1_IRQn;
    }
    else
    #endif

    #if defined (DMA1_Channel2)
    if (hdma->Instance == DMA1_Channel2)
    {
        IRQn = DMA1_Channel2_IRQn;
    }
    else
    #endif

    #if defined (DMA1_Channel3)
    if (hdma->Instance == DMA1_Channel3)
    {
        IRQn = DMA1_Channel3_IRQn;
    }
    else
    #endif

    #if defined (DMA1_Channel4)
    if (hdma->Instance == DMA1_Channel4)
    {
        IRQn = DMA1_Channel4_IRQn;
    }
    else
    #endif

    #if defined (DMA1_Channel5)
    if (hdma->Instance == DMA1_Channel5)
    {
        IRQn = DMA1_Channel5_IRQn;
    }
    else
    #endif

    #if defined (DMA1_Channel6)
    if (hdma->Instance == DMA1_Channel6)
    {
        IRQn = DMA1_Channel6_IRQn;
    }
    else
    #endif

