Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/pal/targets/TARGET_STM32/Src/stm32_cyhal_uart.c
    #if defined (DMA1_Channel7)
    if (hdma->Instance == DMA1_Channel7)
    {
        IRQn = DMA1_Channel7_IRQn;
    }
    else
    #endif

    #if defined (DMA1_Channel8)
    if (hdma->Instance == DMA1_Channel8)
    {
        IRQn = DMA1_Channel8_IRQn;
    }
    else
    #endif

    #if defined (DMA2_Channel1)
    if (hdma->Instance == DMA2_Channel1)
    {
        IRQn = DMA2_Channel1_IRQn;
    }
    else
    #endif

    #if defined (DMA2_Channel2)
    if (hdma->Instance == DMA2_Channel2)
    {
        IRQn = DMA2_Channel2_IRQn;
    }
    else
    #endif

    #if defined (DMA2_Channel3)
    if (hdma->Instance == DMA2_Channel3)
    {
        IRQn = DMA2_Channel3_IRQn;
    }
    else
    #endif

    #if defined (DMA2_Channel4)
    if (hdma->Instance == DMA2_Channel4)
    {
        IRQn = DMA2_Channel4_IRQn;
    }
    else
    #endif

    #if defined (DMA2_Channel5)
    if (hdma->Instance == DMA2_Channel5)
    {
        IRQn = DMA2_Channel5_IRQn;
    }
    else
    #endif

    #if defined (DMA2_Channel6)
    if (hdma->Instance == DMA2_Channel6)
    {
        IRQn = DMA2_Channel6_IRQn;
    }
    else
    #endif

    #if defined (DMA2_Channel7)
    if (hdma->Instance == DMA2_Channel7)
    {
        IRQn = DMA2_Channel7_IRQn;
    }
    else
    #endif

    #if defined (DMA2_Channel8)
    if (hdma->Instance == DMA2_Channel8)
    {
        IRQn = DMA2_Channel8_IRQn;
    }
    else
    #endif
    {
        assert_param(false); /* wrong instance */
    }

    return (IRQn);
}


/***************************************************************************************************
 * _stm32_cyhal_uart_enable_irq
 **************************************************************************************************/
static void _stm32_cyhal_uart_enable_irq(USART_TypeDef* instance, uint32_t priority, bool enable)
{
    /* Use the priority, configured by STM32CubeMx if CYHAL_UART_USE_HAL_IRQ_PRIOPITY
     * has not been defined */
    #if !defined(CYHAL_UART_USE_HAL_IRQ_PRIOPITY)
    (void)priority;
    #endif /* !defined(CYHAL_UART_USE_HAL_IRQ_PRIOPITY) */

    IRQn_Type IRQn = _stm32_cyhal_uart_get_irqn(instance);

    if (enable)
    {
        /* Use the priority, configured by STM32CubeMx if CYHAL_UART_USE_HAL_IRQ_PRIOPITY
         * has not been defined */
        #if defined(CYHAL_UART_USE_HAL_IRQ_PRIOPITY)
        HAL_NVIC_SetPriority(IRQn, priority, 0);
        #endif /* defined(CYHAL_UART_USE_HAL_IRQ_PRIOPITY) */
        HAL_NVIC_EnableIRQ(IRQn);
    }
    else
    {
        HAL_NVIC_DisableIRQ(IRQn);
    }
}


/***************************************************************************************************
 * _stm32_cyhal_uart_critical_section_enter
 **************************************************************************************************/
static void _stm32_cyhal_uart_critical_section_enter(cyhal_uart_t* obj)
{
    /* Force disable UART IRQ */
    HAL_NVIC_DisableIRQ(_stm32_cyhal_uart_get_irqn(obj->huart->Instance));

    /* Disable DMA Stream/Channel IRQ (TX) */
    if (obj->huart->hdmatx != NULL)
    {
        HAL_NVIC_DisableIRQ(_stm32_cyhal_uart_get_dma_irqn(obj->huart->hdmatx));
    }

    /* Disable DMA Stream/Channel IRQ (RX) */
    if (obj->huart->hdmarx != NULL)
    {
        HAL_NVIC_DisableIRQ(_stm32_cyhal_uart_get_dma_irqn(obj->huart->hdmarx));
    }
}


/***************************************************************************************************
 * _stm32_cyhal_uart_critical_section_exit
 **************************************************************************************************/
static void _stm32_cyhal_uart_critical_section_exit(cyhal_uart_t* obj)
{
    IRQn_Type IRQn = _stm32_cyhal_uart_get_irqn(obj->huart->Instance);

    /* Enable UART IRQ if enabled any events  */
    if (obj->irq != 0u)
    {
        HAL_NVIC_EnableIRQ(IRQn);
    }

    /* Disable DMA Stream/Channel IRQ (TX) */
    if (obj->huart->hdmatx != NULL)
    {
        HAL_NVIC_EnableIRQ(_stm32_cyhal_uart_get_dma_irqn(obj->huart->hdmatx));
    }

    /* Disable DMA Stream/Channel IRQ (RX) */
    if (obj->huart->hdmarx != NULL)
    {
        HAL_NVIC_EnableIRQ(_stm32_cyhal_uart_get_dma_irqn(obj->huart->hdmarx));
    }
}


/***************************************************************************************************
 * _stm32_cyhal_uart_alloc_hw
 **************************************************************************************************/
static UART_HandleTypeDef* _stm32_cyhal_uart_alloc_hw(cyhal_uart_t* obj, cyhal_gpio_t tx,
                                                      cyhal_gpio_t rx)
{
    UART_HandleTypeDef* handle = NULL;

    /* Go through _cyhal_uart_structs and find uart handle by TX/RX pins */
    for (uint32_t i = 0u; i < CYHAL_UART_MAX_INSTANCES; i++)
    {
        #if (CYHAL_UART_MAX_INSTANCES > 1)
        if (((tx != NC) && (tx == _cyhal_uart_structs[i].associate_pin)) ||
            ((rx != NC) && (rx == _cyhal_uart_structs[i].associate_pin)))
        #else
        (void)tx;
        (void)rx;
        #endif /* (CYHAL_UART_MAX_INSTANCES > 1) */
        {
            if (_cyhal_uart_structs[i].occupied_obj == NULL)
            {
                handle                              =  _cyhal_uart_structs[i].huart;
                _cyhal_uart_structs[i].occupied_obj = obj;
                break;
            }
        }
    }
    return (handle);
}


/***************************************************************************************************
 * _stm32_cyhal_uart_free_hw
 **************************************************************************************************/
static void _stm32_cyhal_uart_free_hw(cyhal_uart_t* obj)
{
    /* Go through _cyhal_uart_structs and find uart handle by TX/RX pins */
    for (uint32_t i = 0u; i < CYHAL_UART_MAX_INSTANCES; i++)
    {
        if (obj->huart == _cyhal_uart_structs[i].huart)
        {
            _cyhal_uart_structs[i].occupied_obj = NULL;
            break;
        }
    }
}


/***************************************************************************************************
 * _stm32_cyhal_uart_get_obj
 **************************************************************************************************/
#if (USE_HAL_UART_REGISTER_CALLBACKS == 1)
static cyhal_uart_t* _stm32_cyhal_uart_get_obj(UART_HandleTypeDef* huart)
{
    for (uint32_t i = 0u; i < CYHAL_UART_MAX_INSTANCES; i++)
    {
        if (_cyhal_uart_structs[i].occupied_obj->huart == huart)
        {
            return (_cyhal_uart_structs[i].occupied_obj);
        }
    }
    return NULL;
}


#endif /* (USE_HAL_UART_REGISTER_CALLBACKS == 1) */


/***************************************************************************************************
 * _stm32_cyhal_uart_get_struct
 **************************************************************************************************/
#if (CYHAL_UART_USE_RTOS_MUTEX == 1)
static stm32_cyhal_uart_structs_t* _stm32_cyhal_uart_get_struct(cyhal_uart_t* obj)
{
    for (uint32_t i = 0u; i < CYHAL_UART_MAX_INSTANCES; i++)
    {
        if (_cyhal_uart_structs[i].occupied_obj == obj)
        {
            return (&_cyhal_uart_structs[i]);
        }
    }
    return NULL;
}


#endif /* (CYHAL_UART_USE_RTOS_MUTEX == 1) */


/***************************************************************************************************
 * stm32_cypal_uart_hw_init
 **************************************************************************************************/
uint32_t stm32_cypal_uart_hw_init(UART_HandleTypeDef* huart, cyhal_gpio_t associate_pin)
{
    for (uint32_t i = 0u; i < CYHAL_UART_MAX_INSTANCES; i++)
    {
        if (_cyhal_uart_structs[i].huart == NULL)
        {
            _cyhal_uart_structs[i].huart         = huart;
            _cyhal_uart_structs[i].associate_pin = associate_pin;
            return 0u;
        }
    }

    /* Failed to allocate memory for the UART instance. CYHAL_UART_MAX_INSTANCES
     * defines the max number of UART instances (default = 1).
     * Overwrite CYHAL_UART_MAX_INSTANCES in cybsp.h to increase the number of
     * supported UART instances */
    assert_param(false);
    return 1u;
}


/***************************************************************************************************
 * cyhal_uart_readable
 *
 * NOTE: This only returns 0 or 1, which is all that is needed at this time.
 *       But this function is supposed to return the total number of characters available.
 *       This implimentation provides the functionality needed by the command-console,
 *       which is the only library that uses this function.
 **************************************************************************************************/
uint32_t cyhal_uart_readable(cyhal_uart_t* obj)
{
    /* Check the parameters */
    assert_param(NULL != obj);

    return (uint32_t)__HAL_UART_GET_FLAG(obj->huart, UART_FLAG_RXNE);
}


/***************************************************************************************************
 * cyhal_uart_getc
 **************************************************************************************************/
cy_rslt_t cyhal_uart_getc(cyhal_uart_t* obj, uint8_t* value, uint32_t timeout)
{
    uint32_t uart_rx_timeout = timeout;
    HAL_StatusTypeDef status;

    /* Check the parameters */
    assert_param(NULL != obj);
    assert_param(NULL != value);

    /* The "wait forever" case is different for the STM32 function */
    if (uart_rx_timeout == 0)
    {
        uart_rx_timeout = HAL_MAX_DELAY;
    }

    /* Enter UART critical section (disable UART interrupt if it is enabled) */
    _stm32_cyhal_uart_critical_section_enter(obj);

    /* Receive an amount of data in blocking mode */
    status = HAL_UART_Receive(obj->huart, value, 1, uart_rx_timeout);

    /* Exit UART critical section */
    _stm32_cyhal_uart_critical_section_exit(obj);

    return (status == HAL_OK) ? CY_RSLT_SUCCESS : CYHAL_UART_RSLT_ERR_HAL_ERROR;
}


#if defined(__cplusplus)
}
#endif /* defined(__cplusplus) */

#endif /* defined(HAL_UART_MODULE_ENABLED) */
